; domain
(define (domain gripper-strips)
 (:requirements :strips :typing)
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
         (at ?o - object ?x - room)
        (free ?r - robot ?g - gripper)
        (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
         (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
        (not (at ?obj ?room))
        (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
        (free ?r ?g)
        (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-1-4-2)
(:domain gripper-strips)
(:objects robot1 - robot
rgripper1 lgripper1 - gripper
room1 room2 room3 room4 - room
ball1 ball2 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at ball1 room1)
(at ball2 room4)
)
(:goal
(and
(at ball1 room4)
(at ball2 room3)
)
)
)

; plan
1. (move robot1 room1 room4)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room4)
   goals met: 0 of 2
2. (pick robot1 ball2 room4 rgripper1)
   deleted: (at ball2 room4) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 0 of 2
3. (move robot1 room4 room1)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room1)
   goals met: 0 of 2
4. (pick robot1 ball1 room1 lgripper1)
   deleted: (at ball1 room1) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 0 of 2
5. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 0 of 2
6. (drop robot1 ball2 room3 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room3) (free robot1 rgripper1)
   goals met: 1 of 2
7. (move robot1 room3 room4)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room4)
   goals met: 1 of 2
8. (drop robot1 ball1 room4 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room4) (free robot1 lgripper1)
   goals met: 2 of 2
